{
  "basics": {
    "name": "Luis Fernando Barrera",
    "email": "luisfernando@informind.com",
    "image": "https://avatars2.githubusercontent.com/u/1202547?s=460&v=4",
    "label": "Senior Software Engineering Manager (Financial, Accounting, Business, Python)",
    "phone": "+52 55 4848 1150",
    "location": {
      "city": "Mexico City",
      "region": "CDMX",
      "countryCode": "MX",
      "country": "Mexico"
    },
    "summary": "Senior Software Engineering Manager with proven experience building teams and mentoring people. Skilled and enthusiastic Python Programmer with a solid background in Finance, Accounting and Business their Data and Applications.",
    "about": [
      "Senior Software Engineering Manager with a strong drive for building software, leading teams, structuring chaos, organizing complexity. I achieve team objectives by fostering discussions to deeply understand problems and tackle them with a practical, hands-on approach, engage in coding and problem-solving alongside the team, focus on collective success and foster a collaborative environment. Experienced in building teams and mentoring people.",
      "Have the strong belief that the success of a team is not only a function of will and skills from the people but from the culture, the organization and the management team of the company. Enthusiastic about improving within a team, a company and myself.",
      "Skilled and enthusiastic Python Programmer with a solid background in Finance, Accounting and Business their Data and Applications. Love to design and to analyze data through building applications and libraries. I just don't develop projects, I am proud to craft them.",
      "Hopelessly curious and eclectic. Love to learn about any topic to solve problems. I use Getting Things Done (GTD) as personal workflow, practice mindfulness to keep my mind clear, calm and handle stress, and have kept a personal ledger for 10 years.",
      "If your data or project has symbols like '$¢£€¥%', you would probably like to share a coffee or interview me."
    ],
    "profiles": [
      {
        "network": "linkedin",
        "url": "https://www.linkedin.com/in/luisfernandobarrera/",
        "username": "luisfernandobarrera"
      },
      {
        "network": "github",
        "url": "https://github.com/luisfernandobarrera",
        "username": "luisfernandobarrera"
      }
    ]
  },
  "skills": [
    {
      "name": "Engineering Management",
      "keywords": [
        "team building",
        "OKRs and KPIs",
        "mentoring",
        "DevOps",
        "agile methodologies",
        "product requirements",
        "software architecture & design",
        "project management"
      ]
    },
    {
      "name": "Python Data Programming",
      "level": "Expert",
      "keywords": [
        "pandas",
        "dataclasses",
        "numpy",
        "SQLAlchemy",
        "advanced SQL",
        "PostgreSQL",
        "SQLite3"
      ]
    },
    {
      "name": "Python Web Development",
      "level": "Expert",
      "keywords": [
        "django",
        "fastAPI",
        "flask",
        "django-REST",
        "tortoiseORM",
        "REST API",
        "GraphQL",
        "javascript",
        "VueJS",
        "React",
        "HTMX",
        "SASS"
      ]
    },
    {
      "name": "Business",
      "keywords": [
        "administration",
        "accounting",
        "finance",
        "software for SMB",
        "ERP",
        "CRM",
        "taxes",
        "electronic invoicing",
        "electronic signature",
        "financial math"
      ]
    },
    {
      "name": "Tools",
      "keywords": [
        "docker",
        "kubernetes",
        "bash",
        "linux",
        "excel VBA",
        "CircleCI",
        "SDLC",
        "code quality",
        "clean code",
        "networking",
        "continuous integration"
      ]
    }
  ],
  "interests": [
    {
      "name": "General",
      "keywords": [
        "Finance",
        "Money",
        "Administration",
        "Business",
        "Data Management",
        "Entrepreneurship",
        "Markets",
        "Personal Finance",
        "Accounting",
        "Administration",
        "Team Building & Management",
        "Inventories"
      ]
    },
    {
      "name": "Data",
      "keywords": [
        "Financial",
        "Geographical",
        "Data collection",
        "Scraping",
        "Pipelines",
        "Designing Catalogues",
        "Visualization"
      ]
    },
    {
      "name": "Learning",
      "keywords": [
        "Mindfulness",
        "Management Techniques",
        "React",
        "Progressive Web Apps",
        "Serverless Apps",
        "Personal Improvement"
      ]
    }
  ],
  "work": [
    {
      "company": "Banco Covalto",
      "description": "Mexican Fintech Bank",
      "position": "Senior Engineering Manager (Integration and Legacy Services)",
      "location": "Remote and Mexico City",
      "startDate": "2023-12-01",
      "endDate": "2024-03-15",
      "url": "https://covalto.com",
      "summary": "Worked as a de facto Engineering Director for Backend and Integration Services. Reporting directly to the CTO. Kept the role of Manager and Technical Leader with a hands-on approach and programming and structuring code when necessary.",
      "highlights": [
        "Assumed the responsibilities of the Director of Banking Services Engineering to design the technical architecture considering the functional architecture designed by the CTO. Served as a liaison between Financial Product Managers and other people in Operations such as the Chief Operations Officer, the Legal Team and Sales to translate those requirements to Technical teams reviewing needs and ideas and creating or reviewing projects ans their specifications.",
        "Proposed solutions to various integration issues and systems within the Bank by leveraging the capabilities of all teams and compensating for their weaknesses through the use of components such as aligning catalogs and data types. Discussing things like the implementations of BIAN (Banking Industry Architecture Network).",
        "Led the design of two new operation architectures and ideal one with minimal changes and another tailored to the budgetary, temporal, and functional constraints of the bank, always seeking to optimize best engineering practices and address the bank's technological and operational challenges.",
        "Led the requirements to have an architecture that allows the bank to have a efficient, successful and cost-effective implementation of Electronic Banking. Audited the architecture and concluded that changes should be done in order to to that. Proposed to reestructure the Technology team to achieve efficiently those objectives.",
        "Managed a team of 4 people designing and implementing projects such as the financial product quoting system, the electronic signature service with e.firma for contracts, template and document services, and promissory note endorsements with Mifiel blockchain.",
        "Optimized my team to take initiatives to develop projects to help operational areas, apply technology and achieve efficiency in those processes. Promoted an open team dynamic to get ideas and feedback from the team and the rest of the bank to design and achieve maximum impact projects that benefited our internal users and customer.",
        "Led the development of services with Salesforce and Topaz (core banking) to expose APIs that allow for the automation of data flows from origination channel processes by connecting most of the bank's systems. Integrating them through the middleware-based legacy integration platform developed within my team.",
        "Proposed, designed, gather requirements with potential customers, planned, and led the Treasury API project for real-time bank account movement consultation via REST or Webhook using Kafka, Django, and Topaz integration services. Led the consultations to get the customer requirements and gather security and compliance requirements into consideration for the project. Designed the project as a first step in an Open Banking initiative for Covalto."
      ],
      "resumeVerbose": true
    },
    {
      "company": "Banco Covalto",
      "description": "Mexican Fintech Bank",
      "position": "Engineering Manager, Data Engineer, Tech Lead",
      "location": "Remote and Mexico City",
      "startDate": "2022-05-01",
      "endDate": "2023-11-30",
      "url": "https://covalto.com",
      "summary": "Engineering Manager (Fincore/ESB Squad). Portfolio Migration Leader in all the quantitative data as a consultant and Data Engineer.",
      "highlights": [
        "Successfully achieved the Portfolio from SOFOM to Banco Covalto (Lender company to regulated bank). 2 billion Mexican pesos (100 million USD). Migrating from SOFOM's in-house system Loan Management System to Stefanini's Topaz in Banco Covalto. Regulated operation by the Comisión Nacional Bancaria y de Valores (CNBV, Mexican equivalent to the U.S. SEC).",
        "Migration was necessary step to business growth and merger between Credijusto and Banco Covalto (former Finterra) and to get NASDAQ IPO.",
        "Led the collaboration across all business areas and departments to gather the logic from legacy systems and the logic to target systems. Creating all the transformations in between.",
        "Wrote several financial math and accounting modules in a library to calculate, solve, split and do general work with amortization tables, cash flows, accounting, and payment application handling. Written against time with hard deadlines. (More details on the projects section in this CV as pennyworth). Full Coverage. Data testing from source information and in delivered files.",
        "Wrote a library to abstract the Credit Contract to work, fill and share data. Writing multiple extractors to fill these Contracts from different sources: Loan Management Systems, Excel Files, Google Sheet Files, etc.",
        "Delivered normalized data to the business teams for validation and calculations to fill the migration layouts",
        "Worked as Engineering Manager for a team of 6 engineers working with several legacy projects related to payments, financial quotes, loan management systems, and the Enterprise Service Bus (ESB) components.",
        "Improved productivity and metrics through communication and setting OKRs; implementing testing, clean code and best coding and architecture practices."
      ]
    },
    {
      "company": "Credijusto (now Banco Covalto)",
      "description": "Small Business Lending Fintech",
      "position": "Python Data Engineer",
      "location": "Remote and Mexico City",
      "startDate": "2020-02-24",
      "endDate": "2022-04-30",
      "url": "https://credijusto.com",
      "summary": "Python/Django programmer working in the Financial Core (Fincore) team.",
      "highlights": [
        "Maintained and developed Loany, a Portfolio Management System that handles Loans and Leases' transactions and calculations. Using Django and React.",
        "Refactored the Theoretical Table calculations to handle grace periods.",
        "Maintained Core Financial Libraries to handle calculations and settings across the company.",
        "Designed and developed Kardex, a financial transaction database that allows to get reports gathering quantitative and qualitative data. (More details on the projects section in this CV).",
        "Audited all the Loan contracts to arrive to correct calculations and logic based on each subproduct (revolving and simple credit).",
        "Developed strong financial math and accounting skills to help Tech team to understand the financial team needs and provide solutions to major company problems.",
        "Designed the Enterprise Service Bus architecture to message processes across multiple origin and target systems in a sequential process, inspired by the Django middleware architecture."
      ]
    },
    {
      "company": "CIAL Dun & Bradstreet México",
      "description": "Latin America’s leading business data and analytics provider",
      "position": "Python Data Warehouse Developer",
      "location": "Remote and Mexico City",
      "startDate": "2018-10-01",
      "endDate": "2020-01-15",
      "url": "https://cialdnb.com",
      "summary": "Python Programmer working with Kubernetes managing clusters and designing APIs to control and integrate CIAL's Data Collection workflow.",
      "highlights": [
        "Designed APIs to glue stats, status and control of the tasks in the kubernetes cluster using Python, FastAPI and Airtable as a convenient frontend interface (Hyperkube).",
        "Installed, Configured and Managed CialDnB's Kubernetes cluster with distributed storage. Configured Docker image to run the scrapers for collection purposes. (Ragnatela project).",
        "Helped refactoring the in-house designed distributed scrapy-based framework to collect results using redis as a distributed queue with middlewares to send to our data collection pipeline.",
        "Wrote some scrapers using Selenium and Scrapy.",
        "Designed Silk in Django. An API and management system for organizing the sources, schemas and tasks to collect data to feed the business users with Latin American companies' data in Portuguese and Spanish.",
        "Working remotely and asynchronously with a team distributed in Israel, Croatia and Russia."
      ]
    },
    {
      "company": "Shopventory",
      "description": "E-commerce Inventory Management",
      "position": "Django developer",
      "location": "Remote",
      "startDate": "2018-06-01",
      "endDate": "2018-09-15",
      "url": "https://shopventory.com/",
      "summary": "Python/Django programmer and Javascript/AngularJS programmer. Working on the project temporarily.",
      "hide": true,
      "resumeHide": true
    },
    {
      "company": "AdRoll (Tiempo Development)",
      "description": "Digital Marketing Company",
      "url": "https://adroll.com",
      "position": "Software Engineer",
      "location": "Remote",
      "startDate": "2017-05-15",
      "endDate": "2018-01-15",
      "summary": "Python programmer in the Attribution team creating scripts to process big trails of event data in TrailDB.",
      "highlights": [
        "Wrote software to process big trails of advertising events and resume them or transform them in different formats for other internal users.",
        "Designing tests.",
        "Creating APIs in Flask and in Jersey (Java).",
        "Working from home in Mexico City with teams in San Francisco and Monterrey.",
        "Contract through Tiempo Development (https://tiempodev.com/)."
      ],
      "hide": true,
      "resumeHide": true
    },
    {
      "company": "Nextor Telecom",
      "description": "A telecom and telecom related software company.",
      "position": "Lead Software Engineer",
      "location": "Mexico City, MX",
      "startDate": "2014-08-10",
      "endDate": "2017-03-15",
      "url": "https://nextortelecom.com",
      "summary": "Lead developer and maintainer of Nextor Telecom’s software infrastructure. It’s portfolio includes products such as: Vozero, a prepaid VoIP conference service with a self-service user page to collect payments and manage conference calls in real-time; NextorProxy, a Cloud VoIP PBX service among others.",
      "highlights": [
        "Developed Experos a micro ERP for managing the company's administration.",
        "Developed Mango Analytics a comprehensive solution for Call Detail Record, managing and processing large volumes of calls and storing and making available for search call recordings.",
        "Developed a method to quickly setup and create webapps with REST, Django and Bootstrap."
      ],
      "resumeHide": true
    },
    {
      "company": "informind",
      "position": "Founder, Software Engineer",
      "description": "An IT and Software Consulting Company",
      "location": "Mexico City, MX",
      "startDate": "2009-09-30",
      "endDate": "2014-05-06",
      "url": "",
      "summary": "Founder of informind. Python Developer and Software Team Leader. Administrative consultant, Data Management Consultant.",
      "highlights": [
        "Company chiefly focused in Data management (Catalogue design and sanitation, Document schema design)  and the installation of ERP systems in order to generate meaningful and useful information to the Finance, Administration and Executive departments.",
        "We offered to every small and medium sized business, solutions such as Websites, Apps, Servers and Networking consultant.",
        "Our vision was to offer: our customers, a quality and affordable all-in-one IT solution; our employees, the opportunity to learn and grow by offering tailored solutions that are valuable to our customer.",
        "Our customers were in the Manufacturing, Accounting, Commercial, Retail, Healthcare and Publishing industries.",
        "Remote support (telephone and mail) and in-site. Software and Hardware sales. Sales and project planning. Python software development. Software Architect.  External Software implementation. Network design and implementation."
      ]
    },
    {
      "company": "Bank of America Merrill Lynch",
      "description": "Global Bank",
      "position": "Unit Testing Engineer",
      "location": "Mexico City, MX",
      "startDate": "2013-04-01",
      "endDate": "2013-07-31",
      "url": "https://bankofamerica.com.mx",
      "summary": "Unit tester for money market in-house developed software written in Quartz (Bank of America’s Python Development platform).",
      "highlights": [
        "Collaboration and teamwork with Indian, Brazilian and American developers.",
        "Against time project and with adverse situations, objectives met successfully."
      ],
      "hide": true
    }
  ],
  "projects": [
    {
      "name": "Treasury API",
      "entity": "Banco Covalto",
      "type": "Backend API",
      "description": "Treasury API to expose movements to bank customers",
      "startDate": "2024-02-01",
      "endDate": "2024-03-15",
      "roles": [
        "Product Designer",
        "Architect",
        "Manager"
      ],
      "keywords": [
        "kafka",
        "django",
        "accounting",
        "reconciliation systems",
        "product design",
        "webhooks",
        "customer requirements",
        "auth0",
        "regulations & compliance"
      ],
      "summary": "Real-time bank account movement queries via REST API or Webhook. Integrated with financial core vía Kafka and services",
      "highlights": [
        "Proposed, designed, gathered requirements with potential customers, planned, and led the project for real-time bank account movement queries via REST or Webhook.",
        "Designed the project as a first step in an Open Banking initiative for Covalto."
      ]
    },
    {
      "name": "firmas / mifiel",
      "entity": "Banco Covalto",
      "type": "Web Application",
      "description": "Electronic Signature System",
      "startDate": "2023-04-10",
      "endDate": "2024-03-15",
      "roles": [
        "Python Developer",
        "Frontend Developer",
        "Manager"
      ],
      "keywords": [
        "fastapi",
        "PostgreSQL",
        "Mifiel",
        "Web development",
        "TortoiseORM",
        "e.signature",
        "blockchain",
        "aws",
        "s3",
        "google cloud",
        "kubernetes"
      ],
      "summary": "A monolith of services to gather documents for signature, integrate with salesforce and other systems and allow the signature of documents with a mexican electronic fiscal signature.",
      "highlights": [
        "Allows customers to sign legal documents without the need of a physical presence using e.firma and Mifiel Services, without sending documents outside the bank archives",
        "Allows the signature of endosable promissory notes with Mifiel blockchain.",
        "Using FastAPI to create many micro frontends in a same codebase, including APIs to create frontends in React and integrations with other systems such as Salesforce.",
        "Integrated using Covalto's standard infra in GCP and AWS.",
        "Archive using S3/GCS cloud storage. Indexed in PostgreSQL database",
        "Microservice to provide documentes based on templates filled with an API Request. Document Management System",
        "After designing the project, successfully inherited the project to a programmer and just managed, reviewed the code, and gather specifications from the business team to improve it."
      ]
    },
    {
      "name": "Pennyworth",
      "entity": "Covalto, Inc.",
      "type": "Financial Math/Accounting Library",
      "roles": [
        "Designer",
        "Python Developer"
      ],
      "startDate": "2022-01-01",
      "endDate": "2022-12-31",
      "description": "A full-fledged multipurpose financial and accounting library.",
      "keywords": [
        "Business Data",
        "Financial Math",
        "Accounting",
        "Financial libraries",
        "dataclasses",
        "pandas",
        "jupyter"
      ],
      "highlights": [
        "A library with modules to calculate interest, work with cashflows and time value, handle payments,  keep accounting, and calculate and solve amortization tables (schedules).",
        "Calculator: A module to calculate amortization tables given some parameters as interest rate, principal, duration, etc.",
        "Table Module: A Schedule table object to make calculations. Works dynamically ordering calculations as a linked list with caches since records depended on previous record values. Can do operations on it as tables' addition and subtractions, table splits into many tables (for multiloan or complex tables), final payment adjustments, discount ious on time value, and roundings and adjustments.",
        "Solver: A solver working on the table module trying to imitate the GoalSeek module in Excel to change a value until getting another expected one as close as possible. Used to adjust interest rate to different method calculations, until getting zero in balance.",
        "Contract module: An abstraction to handle the Credit Contracts. Using a Contract-Version-Loan structure that contained all the information that the contract could have as: IOUs, Payments, Advance Payments, Restructures, Write-offs, Charges. Used as interchange format in business.",
        "Kardex: A system to generate an Account Statement based on the Contract Structure and applying it to get the correct balance per different scopes such as loan, date, iou, version.",
        "Using numpy_financial, dataclasses, pandas, jupyter."
      ]
    },
    {
      "name": "Kardex",
      "entity": "Credijusto & Covalto, Inc.",
      "type": "Loan Accounting System",
      "roles": [
        "Designer",
        "Python Developer"
      ],
      "startDate": "2020-08-15",
      "endDate": "2022-12-31",
      "description": "A system designed to make calculations on loans",
      "keywords": [
        "business data",
        "SQLAlchemy",
        "Financial Math",
        "Accounting",
        "dataclasses",
        "pandas",
        "jupyter",
        "sqlite3"
      ],
      "highlights": [
        "Problem: Credijusto Loan Management system is a non-transactional system that registers balances instead of transactions.",
        "Main goal is to create a data structure that allows getting the different balances for each loan at any point of time aggregating all the transactions up to that day.",
        "Connect to the existing systems, Loan Management System and CRM, to gathered existing data and convert it to transactions.",
        "Using the data from those transactions calculate the regular interest, moratory interest, penalties, fees and balances in time using different algorithms of calculation depending on rules for products while maintaining accounting consistency, and using debits and credits.",
        "Develop connectors that allow us to fetch information from different sources and convert data to transactions",
        "Develop an accesible SQLAlchemy Python API to allow easy reporting."
      ]
    },
    {
      "name": "This CV",
      "type": "Personal Project",
      "description": "Curriculum Vitae Production System",
      "startDate": "2018-12-17",
      "summary": "A system that builds a Github page with my CV, including a PDF.",
      "url": "https://github.com/luisfernandobarrera/resume",
      "highlights": [
        "Using resume.json format as the basis for storing the CV data.",
        "Using jinja2 as template format.",
        "Using SASS with a stylesheet that formats the template for screen and print media."
      ]
    },
    {
      "name": "Pergamum",
      "entity": "Letras Libres",
      "type": "Custom Application",
      "description": "Document Management System",
      "startDate": "2016-12-01",
      "endDate": "2018-07-01",
      "roles": [
        "Python Developer",
        "Frontend Developer",
        "Deployment and Maintenance"
      ],
      "keywords": [
        "Django",
        "PostgreSQL",
        "Apache Tika",
        "Apache Solr",
        "Bootstrap"
      ],
      "summary": "Search and manage a document database to mine content and cross-reference documents with scrapers to fetch and add new data from news data sources.",
      "highlights": [
        "Using Django and Bootstrap to create an Admin View for users.",
        "Using Apache Tika to fetch metadata.",
        "Using Solr as Search Backend.",
        "Deployed on AWS using ECR and CodeShip.",
        "Code available for review."
      ],
      "hide": true
    },
    {
      "name": "Experos",
      "entity": "Nextor Telecom",
      "type": "ERP",
      "roles": [
        "Backend Developer",
        "Frontend Engineer",
        "Project Owner and Manager"
      ],
      "startDate": "2015-03-01",
      "endDate": "2017-01-15",
      "description": "Custom ERP with Accounting Functionality",
      "highlights": [
        "A micro-ERP with Invoicing, Purchases, Accounts Payable and Receivable capabilities to manage the company and automate processes, and eventually to merchandise it.",
        "Using Django-PostgreSQL, APIs and Knockout for developing mockups and allow frontend engineers to easily integrate it into a previously developed mocked up interface.",
        "Backend: Django, PostgreSQL, Django REST Framework  APIs. M2Crypto, tablib, XML.",
        "Frontend: Knockout.js, Django.js. Bootstrap, React, Redux.",
        "Integrations with Mexican Electronic Invoicing, Electronic Accounting and various banks and payment systems"
      ]
    },
    {
      "name": "coringa",
      "type": "Personal Project",
      "description": "Expense manager",
      "url": "https://github.com/luisfernandobarrera/coringa",
      "highlights": [
        "An API to store Expenses and Income, Budgeting, Cash Flow and Reporting.",
        "By the moment only with a Backend.",
        "Exporting and importing from proprietary system YNAB4."
      ],
      "hide": true
    }
  ],
  "education": [
    {
      "institution": "UNAM",
      "area": "Economics",
      "studyType": "Bachelor",
      "startDate": "2010-08-01",
      "endDate": "2013-05-20"
    }
  ],
  "languages": [
    {
      "language": "Spanish",
      "fluency": "Native"
    },
    {
      "language": "English",
      "fluency": "C1",
      "institution": "The Anglo"
    },
    {
      "language": "Portuguese",
      "fluency": "C1",
      "institution": "Casa do Brasil"
    }
  ],
  "volunteer": [
    {
      "organization": "El Sommelier Económico",
      "startDate": "2016-02-01",
      "summary": "An organization to foster discussion of current trends and multidisciplinary learning.",
      "position": "Member"
    }
  ],
  "meta": {
    "canonical": "https://github.com/luisfernandobarrera/resume",
    "display": "https://cv.luisfernandobarrera.com",
    "gh-pages-domain": "cv.luisfernandobarrera.com",
    "version": "v0.4.0",
    "lastModified": "2024-03-24T01:11:00-06:00",
    "theme": "spartan",
    "notes": ""
  }
}
