{
    "basics": {
        "name": "Luis Fernando Barrera",
        "email": "luisfernando@informind.com",
        "image": "https://avatars2.githubusercontent.com/u/1202547?s=460&v=4",
        "label": "Python Data Engineer (Financial, Accounting, Business)",
        "phone": "+52 55 4848 1150",
        "location": {
            "city": "Ciudad de México",
            "region": "CDMX",
            "countryCode": "MX"
        },
        "summary": "Experienced Python Programmer with a strong background in Finance, Accounting and Business Data and Applications. Love to design and to analyze data through building applications and libraries. Also have experience building teams and mentoring people. Use Getting Things Done (GTD) as personal workflow and have kept a personal ledger for 8 years. If your data has symbols like '$¢£€¥%', probably you would like to have a coffee with me.",
        "profiles": [
            {
                "network": "linkedin",
                "url": "https://www.linkedin.com/in/luisfernandobarrera/",
                "username": "luisfernandobarrera"
            },
            {
                "network": "github",
                "url": "https://github.com/luisfernandobarrera",
                "username": "luisfernandobarrera"
            }
        ]
    },
    "skills": [
        {
            "name": "Python Data Programming",
            "level": "Expert",
            "keywords": [
                "dataclasses", "pandas", "jupyter", "seaborn", "numpy", "anaconda", "poetry"
            ]
        },
        {
            "name": "Python Web Development",
            "level": "Expert",
            "keywords": [
                "django", "flask", "SQLAlchemy", "fastapi", "Django-REST", "REST APIs", "GraphQL"
            ]
        },
        {
            "name": "Work Methodologies",
            "keywords": [
                "Getting Things Done",
                "Behaviour Driven Development",
                "Testing Driven Development",
                "Clean Code",
                "Scrum"
            ]
        },
        {
            "name": "Business",
            "keywords": [
                "Administration", 
                "Accounting", 
                "Software for SMB", 
                "ERP", 
                "CRM", 
                "Taxes", 
                "electronic invoicing"
            ]
        },
        {
            "name": "Databases",
            "level": "Expert",
            "keywords": [
                "SQL", 
                "Data Design",
                "PostgreSQL", 
                "Redis", 
                "MySQL", 
                "sqlite3", 
                "Legacy Databases"
            ]
        },
        {
            "name": "DevOps & Networking",
            "level": "Intermediate",
            "keywords": [
                "Docker", "Kubernetes", "CircleCI", "Networking", "AWS",
                "Windows Server", "Linux"
            ]
        },
        {
            "name": "Web development",
            "keywords": [
                "Javascript",
                "KnockoutJS",
                "VueJS",
                "SASS",
                "HTML",
                "CSS"
            ]
        },
        {
            "name": "Other",
            "level": "Used occasionally",
            "keywords": [
                "Java",
                "PHP",
                "WordPress",
                "Bash",
                "PowerShell"
            ]
        },
        {
            "name": "Tools",
            "keywords": [
                "PyCharm", 
                "Git", 
                "vscode", 
                "zsh", 
                "macOS", 
                "DataGrip", 
                "Excel VBA", 
                "Todoist", 
                "Jira", 
                "Bullet Journaling"
            ]
        },
        {
            "name": "Calculators",
            "keywords": ["Texas Instruments BA II Plus", "HP 10bII+", "Microsoft Excel", "numpy_financial", "Android 10BA Pro"]
        }
    ],
    "interests": [
        {
            "name": "General",
            "keywords": ["Finance", "Money", "Administration", "Business", "Data Management", "Entrepreneurship", "Markets", "Personal Finance", "Accounting", "Administration", "Team Building & Management", "Inventories"]
        },
        {
            "name": "Data",
            "keywords": ["Financial", "Geographical", "Data collection", "Scraping", "Pipelines", "Designing Catalogues", "Visualization"]
        },
        {
            "name": "Learning",
            "keywords": [
                "Dart", 
                "Flutter", 
                "React",
                "Progressive Web Apps",
                "Serverless Apps"
            ]
        }
    ],
    "work": [
        {
            "company": "Covalto, Inc. (Credijusto's holding)",
            "description": "Mexican Fintech Bank",
            "position": "Engineering Manager. Data Engineer. Technical Leader.",
            "location": "Remote and Mexico City",
            "startDate": "2022-05-01",
            "url": "https://covalto.com",
            "summary": "Engineering Manager (Fincore/ESB Squad). Portfolio Migration Leader in all the quantitative data as consultant and Data Engineer.",
            "highlights": [
                "Achieved successfully the Portfolio Migration from SOFOM to Bank. 2 billion Mexican pesos (100 million USD). Migrating from SOFOM's in-house system LMS to Stefanini's Topaz in Banco Covalto. Regulated operation by the Comisión Nacional Bancaria y de Valores (CNBV, Mexican equivalent to the U.S. SEC).",
                "Migration was necessary step to business growth and merger between Credijusto and Banco Covalto (former Finterra) and to get NASDAQ IPO.",
                "Led the collaboration across all business areas and departments to gather the logic from legacy systems and the logic to target systems. Creating all the transformations in between.",
                "Wrote several financial math and accounting modules in a library to calculate, solve, split and do general work with amortization tables, cash flows, accounting, and payment application handling. Written against time with hard deadlines. (More details on the projects section in this CV as pennyworth). Full Coverage. Data testing from source information and in delivered files.",
                "Wrote a library to abstract the Credit Contract to work, fill and share data. Writing multiple extractors to fill these Contracts from different sources: Loan Management Systems, Excel Files, Google Sheet Files, etc.",
                "Delivered normalized data to the business teams for validation and calculations to fill the migration layouts",
                "Worked as Engineering Manager for a team of 6 engineers working with several legacy projects related to payments, financial quotes, loan management systems, and the Enterprise Service Bus components.",
                "Improved productivity and metrics through communication and setting OKRs; implementing testing, clean code and best coding and architecture practices."
            ]
        },
        {
            "company": "Credijusto",
            "description": "Small Business Lending Fintech",
            "position": "Python Data Engineer",
            "location": "Remote and Mexico City",
            "startDate": "2020-02-24",
            "endDate": "2022-04-30",
            "url": "https://credijusto.com",
            "summary": "Python/Django programmer working in the Financial Core (Fincore) team.",
            "highlights": [
                "Maintained and developed Loany, a Portfolio Management System that handles Loans and Leases' transactions and calculations. Using Django and React.",
                "Refactored the Theoretical Table calculations to handle grace periods.",
                "Maintained Core Financial Libraries to handle calculations and settings across the company.",
                "Designed and developed Kardex, a financial transaction database that allows to get reports gathering quantitative and qualitative data. (More details on the projects section in this CV).",
                "Audited all the Loan contracts to arrive to correct calculations and logic based on each subproduct (revolving and simple credit).",
                "Developed strong financial math and accounting skills to help Tech team to understand the financial team needs and provide solutions to major company problems.",
                "Designed the Enterprise Service Bus architecture to message processes across multiple origin and target systems in a sequential process, inspired by the Django middleware architecture."
            ]
        },
        {
            "company": "Cial Dun&Bradstreet México",
            "description": "Latin America’s leading business data and analytics provider",
            "position": "Python Data Warehouse Developer",
            "location": "Remote and Mexico City",
            "startDate": "2018-10-01",
            "endDate": "2020-01-15",
            "url": "https://cialdnb.com",
            "summary": "Python Programmer working with Kubernetes managing clusters and designing APIs to control and integrate Cial's Data Collection workflow.",
            "highlights": [
                "Designed APIs to glue stats, status and control of the tasks in the kubernetes cluster using python, FastAPI and Airtable as a convenient frontend interface (Hyperkube).",
                "Installed, Configured and Managed CialDnB's Kubernetes cluster with distributed storage. Configured Docker image to run the scrapers for collection purposes. (Ragnatela project).",
                "Helped refactoring the in-house designed distributed scrapy-based framework to collect results using redis as a distributed queue with middlewares to send to our data collection pipeline.",
                "Wrote some scrapers using Selenium and Scrapy.",
                "Designed Silk in Django. An API and management system for organizing the sources, schemas and tasks to collect data to feed the business users with Latin American companies' data in Portuguese and Spanish.",
                "Working remotely and asynchronously with a team distributed in Israel, Croatia and Russia."
            ]
        },
        {
            "company": "Shopventory",
            "description": "E-commerce Inventory Management",
            "position": "Django developer",
            "location": "Remote",
            "startDate": "2018-06-01",
            "endDate": "2018-09-15",
            "url": "https://shopventory.com/",
            "summary": "Python/Django programmer and Javascript/AngularJS programmer. Working on the project temporarily.",
            "hide": true
        },
        {
            "company": "AdRoll (Tiempo Development)",
            "description": "Digital Marketing Company",
            "url": "https://adroll.com",
            "position": "Software Engineer",
            "location": "Remote",
            "startDate": "2017-05-15",
            "endDate": "2018-01-15",
            "summary": "Python programmer in the Attribution team creating scripts to process big trails of event data in TrailDB.",
            "highlights": [
                "Wrote software to process big trails of advertising events and resume them or transform them in different formats for other internal users.",
                "Designing tests.",
                "Creating APIs in Flask and in Jersey (Java).",
                "Working from home in Mexico City with teams in San Francisco and Monterrey.",
                "Contract through Tiempo Development (https://tiempodev.com/)."
            ],
            "hide": true
        },
        {
            "company": "Nextor Telecom",
            "description": "A telecom and telecom related software company.",
            "position": "Lead Software Engineer",
            "location": "Mexico City, MX",
            "startDate": "2014-08-10",
            "endDate": "2017-03-15",
            "url": "https://nextortelecom.com",
            "summary": "Lead developer and maintainer of Nextor Telecom’s software infrastructure. It’s portfolio includes products such as: Vozero, a prepaid VoIP conference service with a self-service user page to collect payments and manage conference calls in real-time; NextorProxy, a Cloud VoIP PBX service among others.",
            "highlights": [
                "Developed Experos a micro ERP for managing the company's administration.",
                "Developed Mango Analytics a comprehensive solution for Call Detail Record, managing and processing large volumes of calls and storing and making available for search call recordings.",
                "Developed a method to quickly setup and create webapps with REST, Django and Bootstrap."
            ]
        },
        {
            "company": "informind",
            "position": "Founder and Developer",
            "description": "An IT and Software Consulting Company",
            "location": "Mexico City, MX",
            "startDate": "2009-09-30",
            "endDate": "2014-05-06",
            "url": "",
            "summary": "Founder of Informind. Python Developer and Software Team Leader. Administrative consultant, Data Management Consultant.",
            "highlights": [
                "Company chiefly focused in Data management (Catalogue design and sanitation, Document schema design)  and the installation of ERP systems in order to generate meaningful and useful information to the Finance, Administration and Executive departments.",
                "We offered to every small and medium sized business, solutions such as Websites, Apps, Servers and Networking consultant.",
                "Our vision was to offer: our customers, a quality and affordable all-in-one IT solution; our employees, the opportunity to learn and grow by offering tailored solutions that are valuable to our customer.",
                "Our customers were in the Manufacturing, Accounting, Commercial, Retail, Healthcare and Publishing industries.",
                "Remote support (telephone and mail) and in-site. Software and Hardware sales. Sales and project planning. Python software development. Software Architect.  External Software implementation. Network design and implementation."
            ]
        },
        {
            "company": "Bank of America Merrill Lynch",
            "description": "Global Bank",
            "position": "Unit Testing Engineer",
            "location": "Mexico City, MX",
            "startDate": "2013-04-01",
            "endDate": "2013-07-31",
            "url": "https://bankofamerica.com.mx",
            "summary": "Unit tester for money market in-house developed software written in Quartz (Bank of America’s Python Development platform).",
            "highlights": [
                "Collaboration and teamwork with Indian, Brazilian and American developers.",
                "Against time project and with adverse situations, objectives met successfully."
            ],
            "hide": true
        }
    ],
    "projects": [
        {
            "name": "Pennyworth",
            "entity": "Covalto, Inc.",
            "type": "Financial Math/Accounting Library",
            "roles": ["Designer", "Python Developer"],
            "startDate": "2022-01-01",
            "endDate": "2022-12-31",
            "description": "A full-fledged multipurpose financial and accounting library.",
            "keywords": ["Business Data", "Financial Math", "Accounting"],
            "highlights": [
                "A library with modules to calculate interest, work with cashflows and time value, handle payments,  keep accounting, and calculate and solve amortization tables (schedules).",
                "Calculator: A module to calculate amortization tables given some parameters as interest rate, principal, duration, etc.",
                "Table Module: A Schedule table object to make calculations. Works dynamically ordering calculations as a linked list with caches since records depended on previous record values. Can do operations on it as tables' addition and subtractions, table splits into many tables (for multiloan or complex tables), final payment adjustments, discount ious on time value, and roundings and adjustments.",
                "Solver: A solver working on the table module trying to imitate the GoalSeek module in Excel to change a value until getting another expected one as close as possible. Used to adjust interest rate to different method calculations, until getting zero in balance.",
                "Contract module: An abstraction to handle the Credit Contracts. Using a Contract-Version-Loan structure that contained all the information that the contract could have as IOUs, Payments, Advance Payments, Restructures, Write-offs, charges. Used as interchange format in business.",
                "Kardex: A system to generate a Account Statement based on the Contract Structure and applying it to get the correct balance per different scopes such as loan, date, iou, version.",
                "Using numpy_financial, dataclasses, pandas, jupyter."
            ]
        },
        {
            "name": "Kardex",
            "entity": "Credijusto & Covalto, Inc.",
            "type": "Loan Accounting System",
            "roles": ["Designer", "Python Developer"],
            "startDate": "2020-08-15",
            "endDate": "2022-12-31",
            "description": "A system designed to make calculations on loans",
            "keywords": ["SQLAlchemy", "Financial Math", "Accounting"],
            "highlights": [
                "Problem: Credijusto Loan Management system is a non-transactional system that register balances instead of transactions.",
                "Main goal is to create a data structure that allows getting the different balances for each loan in any point of time aggregating all the transactions up to that day.",
                "Connect to the existing systems, Loan Management System and CRM, to gather existing data and convert it to transactions.",
                "Using the data from those transactions calculate the regular interest, moratory interest, penalties, fees and balances in time using different algorithms of calculation depending on rules for products while maintaining accounting consistency, and using debits and credits.",
                "Develop connectors that allow us to fetch information from different sources and convert data to transactions",
                "Develop an accesible SQLAlchemy Python API to allow easy reporting."
            ]
        },
        {
            "name": "This CV",
            "type": "Personal Project",
            "description": "Curriculum Vitae Production System",
            "startDate": "2018-12-17",
            "summary": "A system that builds a Github page with my CV, including a PDF.",
            "url": "https://github.com/luisfernandobarrera/resume",
            "highlights": [
                "Using resume.json format as the basis for storing the CV data.",
                "Using jinja2 as template format.",
                "Using SASS with a stylesheet that formats the template for screen and print media."
            ]
        },
        {
            "name": "Pergamum",
            "entity": "Letras Libres",
            "type": "Custom Application",
            "description": "Document Management System",
            "startDate": "2016-12-01",
            "endDate": "2018-07-01",
            "roles": ["Python Developer", "Frontend Developer", "Deployment and Maintenance"],
            "keywords": ["Django", "PostgreSQL", "Apache Tika", "Apache Solr", "Bootstrap"],
            "summary": "Search and manage a document database to mine content and cross-reference documents with scrapers to fetch and add new data from news data sources.",
            "highlights": [
                "Using Django and Bootstrap to create an Admin View for users.",
                "Using Apache Tika to fetch metadata.",
                "Using Solr as Search Backend.",
                "Deployed on AWS using ECR and CodeShip.",
                "Code available for review."
            ],
            "hide": true
        },
        {
            "name": "Experos",
            "entity": "Nextor Telecom",
            "type": "ERP",
            "roles": ["Backend Developer", "Frontend Engineer", "Project Owner and Manager"],
            "startDate": "2015-03-01",
            "endDate": "2017-01-15",
            "description": "Custom ERP with Accounting Functionality",
            "highlights": [
                "A micro-ERP with Invoicing, Purchases, Accounts Payable and Receivable capabilities to manage the company and automate processes, and eventually to merchandise it.",
                "Using Django-PostgreSQL, APIs and Knockout for developing mockups and allow frontend engineers to easily integrate it into a previously developed mocked up interface.",
                "Backend: Django, PostgreSQL, Django REST Framework  APIs. M2Crypto, tablib, XML.",
                "Frontend: Knockout.Js Django.js. Bootstrap, React, Redux.",
                "Integrations with Mexican Electronic Invoicing, Electronic Accounting and various banks and payment systems"
            ]
        },
        {
            "name": "coringa",
            "type": "Personal Project",
            "description": "Expense manager",
            "url": "https://github.com/luisfernandobarrera/coringa",
            "highlights": [
                "An API to store Expenses and Income, Budgeting, Cash Flow and Reporting.",
                "By the moment only with a Backend.",
                "Exporting and importing from proprietary system YNAB4."
            ],
            "hide": true
        }
    ],
    "education": [
        {
            "institution": "UNAM",
            "area": "Economics",
            "studyType": "Bachelor",
            "startDate": "2010-08-01",
            "endDate": "2013-05-20"
        }
    ],
    "languages": [
        {
            "language": "Spanish",
            "fluency": "Native"
        },
        {
            "language": "English",
            "fluency": "C1",
            "institution": "The Anglo"
        },
        {
            "language": "Portuguese",
            "fluency": "C1",
            "institution": "Casa do Brasil"
        },
        {   
            "language": "Russian",
            "fluency": "A2",
            "institution": "Shkola Idiomas"
        }
    ],
    "volunteer": [
        {
            "organization": "El Sommelier Económico",
            "startDate": "2016-02-01",
            "summary": "An organization to foster discussion of current trends and multidisciplinary learning.",
            "position": "Member"
        }
    ],
    "meta": {
        "canonical": "https://github.com/luisfernandobarrera/resume",
        "display": "https://cv.luisfernandobarrera.com",
        "gh-pages-domain": "cv.luisfernandobarrera.com",
        "version": "v0.2.0",
        "lastModified": "2022-12-30T02:30:00-06:00",
        "theme": "spartan",
        "notes": ""
    }
}
